БИТУправление_медицинским_центром_демо/src/Catalogs/ТипыОбращений/ТипыОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОбращений</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипОбъектаОбратнойСвязи</name>
    <type>
      <types>EnumRef.ТипОбъектаОбратнойСвязи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаОбслуживание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/ТипОбъектаОбратнойСвязи/ТипОбъектаОбратнойСвязи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипОбъектаОбратнойСвязи</name>
  <enumValues>
    <name>НеУказывается</name>
  </enumValues>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>ОбъектОбратнойСвязи</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ТипыОбращений/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидОбращенияПриИзменении(Элемент)
	
	Если Объект.ЗаявкаНаОбслуживание Тогда 
		Объект.ТипОбъектаОбратнойСвязи = ПредопределенноеЗначение("Перечисление.ТипОбъектаОбратнойСвязи.НеУказывается");
	КонецЕсли;
	
	НастроитьВидимостьИДоступность();

КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьИДоступность()

	Элементы.Исполнители.Видимость = Объект.ЗаявкаНаОбслуживание;
	Элементы.ТипОбъектаОбратнойСвязи.Видимость = Не Объект.ЗаявкаНаОбслуживание;
	Элементы.ТипОбъектаОбратнойСвязи.Доступность = Не Объект.ЗаявкаНаОбслуживание;
	
КонецПроцедуры

#КонецОбласти
